part of '../../../../eb_menu.dart';

const _termsOfServiceText = '''
얼리버디 이용약관

제1장 환영합니다!

제1조 목적
얼리버디(이하 '서비스')를 이용해 주셔서 감사합니다. 서비스는 여러분이 서비스가 제공하는 다양한 모바일 서비스에 더 가깝게 다가갈 수 있도록 통합 적용될 수 있는 얼리버디 통합 약관(이하 '본 약관')을 마련하였습니다. 본 약관은 여러분이 서비스를 이용하는 데 필요한 권리, 의무 및 책임사항, 이용조건 및 절차 등 기본적인 사항을 규정하고 있으므로 조금만 시간을 내서 주의 깊게 읽어주시기 바랍니다.

제2조 약관의 효력
본 약관의 내용은 서비스가 제공하는 개별 서비스 또는 서비스 초기 화면에 게시하거나 기타의 방법으로 공지합니다.
서비스는 이 약관의 내용을 변경할 수 있으며, 변경된 약관은 제 1항과 같은 방법으로 공지 또는 통지함으로서 효력을 발생합니다.

제3조 약관 이외의 준칙
이 약관에 명시되지 않은 사항이 전기통신 기본법, 전기통신 사업법, 기타 관련 법령에 규정되어있는 경우 그 규정에 따릅니다.

제2장 서비스의 이용

제4조 이용계약의 체결
회원가입시 이 계약이 체결된 것으로 간주합니다.

제5조 용어의 정의
이 약관에서 사용하는 용어의 정의는 다음과 같습니다.
회원 : '얼리버디'와 서비스 이용에 관한 계약을 체결한 자
아이디(ID) : 회원 식별과 회원의 서비스 이용을 위하여 회원이 선정하고 '얼리버디'가 승인하는 문자와 숫자의 조합
비밀번호 : 회원이 통신상의 자신의 비밀을 보호하기 위해 선정한 문자와 숫자의 조합

제6조 이용신청
회원가입은 온라인으로 가입신청 양식에 기록하여 제출함으로써 이용신청을 할 수 있습니다.
가입희망 회원은 반드시 1개의 ID만 신청을 할 수 있습니다.

제7조 회원가입의 승낙
'얼리버디'의 회원가입 신청 양식에 가입 희망 회원이 인터넷으로 제6조와 같이 신청하면 서비스는 바로 가입을 승인하여 서비스를 이용할 수 있습니다.

제8조 서비스 제공의 중지
'얼리버디'는 다음 각 호의 1에 해당하는 경우 서비스의 제공을 중지할 수 있습니다. 설비의 보수 등을 위하여 부득이한 경우
전기통신사업법에 규정된 기간통신사업자가 전기통신서비스를 중지하는 경우 기타 서비스가 서비스를 제공할 수 없는 사유가 발생한 경우

제9조 '얼리버디'의 의무
계속적, 안정적으로 서비스를 제공할 수 있도록 최선의 노력을 다하여야 합니다. 항상 회원의 신용정보를 포함한 개인신상정보의 보안에 대하여 관리에 만전을 기함으로서 회원의 정보보안에 최선을 다하여야 합니다.

제10조 개인정보보호
서비스는 이용자의 정보수집시 서비스의 제공에 필요한 최소한의 정보를 수집합니다.
제공된 개인정보는 당해 이용자의 동의 없이 목적 외의 이용이나 제3자에게 제공할 수 없으며, 이에 대한 모든 책임은 서비스가 집니다.
회원은 언제든지 서비스가 가지고 있는 자신의 정보에 대해 열람 및 오류정정을 요구할 수 있으며 서비스는 이에 대해 지체 없이 처리합니다.

제11조 회원의 의무
회원은 관계법령, 이 약관의 규정, 이용안내 및 주의사항 등 서비스가 통지하는 사항을 준수하여야 합니다.
회원은 승낙 없이 서비스를 이용하여 얻은 정보를 서비스의 사전 승낙 없이 복사, 복제, 변경, 번역, 출판, 방송 기타의 방법으로 사용하거나 이를 제공할 수 없습니다. 회원은 사전 승낙 없이 서비스를 이용하여 어떠한 영리 행위도 할 수 없습니다.

제12조 게시물에 대한 권리•의무
게시물에 대한 저작권을 포함한 모든 권리 및 책임은 이를 게시한 회원에게 있습니다.

제13조 양도금지
회원이 서비스의 이용권한, 기타 이용계약상 지위를 타인에게 양도, 증여할 수 없으며, 이를 담보로 제공할 수 없습니다.


얼리버디 위치정보 이용약관

제 1조 목적
이 약관은 얼리버디(이하 '서비스')가 제공하는 위치정보사업 또는 위치기반서비스 사업과 관련하여 회사와 개인위치정보주체와의 권리, 의무 및 책임사항, 기타 필요한 사항을 규정함을 목적으로 합니다.

제 2조 약관 외 준칙
이 약관에 명시되지 않은 사항은 위치정보의 보호 및 이용 등에 관한 법률, 정보통신 망이용촉진 및 정보보호 등에 관한 법률, 전기통신기본법, 전기통신사업법 등 관계 법령과 회사의 이용약관 및 개인정보 처리방침, 회사가 별도로 정한 지침 등에 의합니다.

제 3조 서비스 내용 및 요금
1. 회사는 직접 위치정보를 수집하거나 위치정보 사업자로부터 위치정보를 전달받아 아래와 같은 위치기반 서비스를 제공합니다.
1-1. 위치정보를 활용한 검색결과 제공 서비스: 정보 검색을 요청하거나 개인위치정보 주체 또는 이동성 있는 기기의 위치정보를 제공시 본 위치정보와 사용자 서비스 이용 데이터를 이용한 검색결과 및 주변결과(맛집, 주변업체, 교통수단 등)를 제시합니다.
1-2. 이용자 위치를 활용한 광고정보 제공: 검색결과 또는 기타 서비스 이용 과정에서 개인위치정보주체 또는 이동성 있는 기기의 위치를 이용하여 광고소재를 제시합니다.
1-3. 길 안내 등 생활편의 서비스 제공: 교통정보와 길 안내 등 최적의 경로를 지도로 제공하며, 주변 시설물 찾기, 다양한 생활 편의 서비스를 제공합니다.
2. 제1항 위치기반서비스의 이용요금은 일반사용자에겐 무료이며, 업체의 광고 수단으로 활용할 경우에는 유료 과금이 부여됩니다.

제 4조 개인위치정보주체의 권리
1. 개인위치정보주체는 개인위치정보 수집 범위 및 이용약관의 내용 중 일부 또는 개인위치정보의 이용·제공 목적, 제공받는 자의 범위 및 위치기반서비스의 일부에 대하여 동의를 유보할 수 있습니다.
2. 개인위치정보주체는 개인위치정보의 수집•이용•제공에 대한 동의의 전부 또는 일부를 철회할 수 있습니다.
3. 개인위치정보주체는 언제든지 개인위치정보의 수집•이용•제공의 일시적인 중지를 요구할 수 있습니다. 경우 회사는 요구를 거절하지 아니하며, 이를 위한 기술적 수단을 갖추고 있습니다.
4. 개인위치정보주체는 회사에 대하여 아래 자료의 열람 또는 고지를 요구할 수 있고, 당해 자료에 오류가 있는 경우에는 그 정정을 요구할 수 있습니다. 경우 회사는 정당한 이유 없이 요구를 거절하지 아니합니다.
4-1. 개인위치정보주체에 대한 위치정보 수집•이용•제공사실 확인자료
4-2. 개인위치정보주체의 개인위치정보가 위치정보의 보호 및 이용 등에 관한 법률 또는 다른 법령의 규정에 의하여 제3자에게 제공된 이유 및 내용
5. 회사는 개인위치정보주체가 동의의 전부 또는 일부를 철회한 경우에는 지체 없이 수집된 개인위치정보 및 위치정보 수집•이용•제공사실 확인자료를 파기합니다. 단, 동의의 일부를 철회하는 경우에는 철회하는 부분의 개인위치정보 및 위치정보 수집•이용•제공사실 확인자료에 한합니다.

제 5조 법정대리인의 권리
1. 회사는 만 14세 미만 아동으로부터 개인위치정보를 수집·이용 또는 제공하고자 하는 경우에는 만 14세 미만 아동과 그 법정대리인의 동의를 받아야 합니다.
2. 법정대리인은 만 14세 미만 아동의 개인위치정보를 수집•이용•제공에 동의하는 경우 동의유보권, 동의철회권 및 일시중지권, 열람•고지요구권을 행사할 수 있습니다.

제 6조 (위치정보 이용·제공사실 확인자료 보유근거 및 보유기간)
1. 회사는 위치정보의 보호 및 이용 등에 관한 법률 제 16조 제 2항에 근거하여 개인위치정보주체에 대한 위치정보 수집•이용•제공사실 확인자료를 위치정보시스템에 자동으로 기록하며, 6개월 이상 보관합니다.

제 7조 (서비스의 변경 및 중지)
1. 회사는 위치정보사업자의 정책변경 등과 같이 회사의 제반 사정 또는 법률상의 장애 등으로 서비스를 유지할 수 없는 경우, 서비스의 전부 또는 일부를 제한, 변경하거나 중지할 수 있습니다.
2. 제 1항에 의한 서비스 중단의 경우에는 회사는 사전에 인터넷 등에 공지하거나 개인위치정보주체에게 통지합니다.

제 8조 (개인위치정보 제3자 제공시 즉시 통보)
1. 회사는 개인위치정보주체의 동의 없이 당해 개인위치정보주체의 개인위치정보를 제3자에게 제공하지 아니하며, 제3자 제공 서비스를 제공하는 경우에는 제공 받는 자 및 제공목적을 사전에 개인위치정보주체에게 고지하고 동의를 받습니다.
2. 회사는 개인위치정보를 개인위치정보주체가 지정하는 제3자에게 제공하는 경우 에는 개인위치정보를 수집한 당해 통신단말장치로 매회 개인위치정보주체에게 제 공받는 자, 제공일시 및 제공목적을 즉시 통보합니다.
3. 다만, 아래에 해당하는 경우에는 개인위치정보주체가 미리 특정하여 지정한 통신 단말장치 또는 전자우편주소 등으로 통보합니다.
3-1. 개인위치정보를 수집한 당해 통신단말장치가 문자, 음성 또는 영상의 수신기능을 갖추지 아니한 경우
3-2. 개인위치정보주체가 개인위치정보를 수집한 당해 통신단말장치 외의 통신단말장치 또는 전자우편주소 등으로 통보할 것을 미리 요청한 경우

제 9조 (8세 이하의 아동 등의 보호의무자의 권리)
1. 회사는 아래의 경우에 해당하는 자(이하 "8세 이하의 아동"이라 한다)의 보호의무자가 8세 이하의 아동 등의 생명 또는 신체보호를 위하여 개인위치정보의 이용 또는 제공에 동의하는 경우에는 본인의 동의가 있는 것으로 봅니다.
1-1. 8세 이하의 아동
1-2. 금치산자
1-3. 장애인복지법 제 2조 제 2항 제 2호의 규정에 의한 정신적 장애를 가진 자로서 장애인고용촉진 및 직업재활법 제 2조 제 2호의 규정에 의한 중증장애인에 해당하는 자(장애인복지법 제29조의 규정에 의하여 장애인등록을 한 자에 한한다)
2. 8세 이하의 아동 등의 생명 또는 신체의 보호를 위하여 개인위치정보의 이용 또는 제공에 동의를 하고자 하는 보호의무자는 서면동의서에 보호의무자임을 증명하는 서면을 첨부하여 회사에 제출하여야 합니다.
3. 보호의무자는 8세 이하의 아동 등의 개인위치정보 이용 또는 제공에 동의하는 경우 개인위치정보주체 권리의 전부를 행사할 수 있습니다.

제 10조 (손해배상)
1. 개인위치정보주체는 회사의 위치정보의 보호 및 이용 등에 관한 법률 제15조 내지 26조의 규정을 위반한 행위로 손해를 입은 경우에 회사에 대하여 손해배상을 청구할 수 있습니다. 이 경우 회사는 고의 또는 과실이 없음을 입증하지 아니하면 책임을 면할 수 없습니다.

제 11조 (분쟁의 조정)
1. 회사는 위치정보와 관련된 분쟁에 대하여 개인위치정보주체와 협의가 이루어지지 아니하거나 협의를 할 수 없는 경우에는 방송통신위원회에 재정을 신청할 수 있습니다.
2. 회사 또는 개인위치정보주체는 위치정보와 관련된 분쟁에 대해 당사자간 협의가 이루어지지 아니하거나 협의를 할 수 없는 경우에는 개인정보보호법에 따라 개인정보분쟁조정위원회에 조정을 신청할 수 있습니다.

제 12조 (사업자 정보)
회사의 상호, 주소, 전화번호 그 밖의 연락처는 다음과 같습니다.
상호: 온타임
주소: 경기도 하남시 미사강변대로 95
전화번호: 010-8645-2275
이메일 주소: dusgh4321@naver.com
부칙
제 1조 시행일
본 약관은 2022년 01월 01일부터 적용됩니다.

제 2조 위치정보관리 책임자 정보
회사는 다음과 같이 위치정보 관리책임자를 지정하여 이용자들이 서비스 이용과정에서 발생한 민원사항 처리를 비롯하여 개인위치정보주체의 권리 보호를 위해 힘쓰고 있습니다.
위치정보 관리책임자: (개인)정보보호 담당 부서 총책임자
전화번호 : 010-8645-2275
이메일 주소 : dusgh4321@naver.com
''';

final class TermsOfServiceView extends StatelessWidget {
  const TermsOfServiceView({super.key});

  @override
  Widget build(BuildContext context) {
    return const LongTextView(
      title: '서비스 이용약관',
      longText: _termsOfServiceText,
    );
  }
}
